mars3142/warnemuende-lighthouses/firmware/sdkconfig.defaults.esp32h2
# default ESP target
CONFIG_IDF_TARGET="esp32h2"

# ESP32-H2 has no WiFi hardware (Thread/BLE only)
CONFIG_ENABLE_WIFI_STATION=n
CONFIG_ENABLE_WIFI_AP=n
CONFIG_ENABLE_WIFI_TELEMETRY=n

# ESP System Settings
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_48=y

# OpenThread FTD (Full Thread Device)
# Allows the device to act as a Router and extend the mesh network.
CONFIG_OPENTHREAD_FTD=y
CONFIG_OPENTHREAD_MTD=n

# Thread channel — must match system-control (C6)
CONFIG_OPENTHREAD_NETWORK_CHANNEL=18

# OpenThread log level — WARN keeps the serial output manageable
CONFIG_OPENTHREAD_LOG_LEVEL_WARN=y
